dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
#include "uart-console.h"
#include "console-cli.h"

#include <math.h>
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#if !defined(_CLI_OUT_MESSAGE)
#define _CLI_OUT_MESSAGE "1/3"
#endif
extern Cli_t    cli_;
extern CliCmd_t cmd_[_CLI_CMD_MAX_NUM];
bool            console_rx_enabled_ = true;

// ============================================================================
#if defined(CONSOLE_IS_USED)

UART_HandleTypeDef hconsole_;
#if defined(STM32F303xE) || defined(STM32F767xx)
uint16_t uh_mask_;
#endif
// ----------------------------------------------------------------------------
struct {
    char  buffer[_CONSOLE_BUFF_LEN];
    char* r_ptr;  // read pointer
    char* w_ptr;  // write pointer
} rb;

// ----------------------------------------------------------------------------
static void ConsoleSetChar(uint8_t* buf, uint32_t len);

// ============================================================================
// common used functions
static void ConsoleUartIRQ(void) {
    uint8_t recv;
    // new way, need more test -----------
    if (__HAL_UART_GET_FLAG(&hconsole_, UART_FLAG_RXNE) != RESET) {
#if defined(STM32F303xE) || defined(STM32F767xx)
        recv = (uint8_t)(hconsole_.Instance->RDR & ( uint8_t )uh_mask_);
#else
        // this HAL API is very un-efficient, need to revise
        HAL_UART_Receive(&hconsole_, &recv, 1, 1000);
#endif
        if (console_rx_enabled_) {
            ConsoleSetChar(&recv, 1);
        }
    }
    // reference code: may be different for different series:
    // clear the interrupt flag
    // hconsole_.Instance->SR &= ( uint16_t )~USART_FLAG_RXNE;
    // // receive data
    // uint8_t recv = ( uint8_t )( hconsole_.Instance->DR & ( uint16_t )0x01FF
    // ); ConsoleSetChar( &recv, 1 );
}

// ----------------------------------------------------------------------------
#if defined(STM32F030x8)
static void InitUartPins(GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                         GPIO_TypeDef* GPIOx_R, uint8_t pin_nR,
                         uint32_t alter) {
    utils.clock.enableGpio(GPIOx_T);
    utils.clock.enableGpio(GPIOx_R);
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin       = 1 << pin_nT;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull      = GPIO_PULLUP;
    GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Alternate = alter;
    HAL_GPIO_Init(GPIOx_T, &GPIO_InitStructure);
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;  // this is not GPIO_MODE_INPUT
    GPIO_InitStructure.Pull  = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOx_R, &GPIO_InitStructure);
}
#endif  // STM32F030x8

// ----------------------------------------------------------------------------
#if defined(STM32F103xB) || defined(STM32F107xC)
static void InitUartPins(GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                         GPIO_TypeDef* GPIOx_R, uint8_t pin_nR) {

    utils.clock.enableGpio(GPIOx_T);
    utils.clock.enableGpio(GPIOx_R);
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin   = 1 << pin_nT;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOx_T, &GPIO_InitStructure);
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_INPUT;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOx_R, &GPIO_InitStructure);
}
#endif  // STM32F103xB || STM32F107xC

// ----------------------------------------------------------------------------
#if defined(STM32F303xE)
static void InitUartPins(GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                         GPIO_TypeDef* GPIOx_R, uint8_t pin_nR,
                         uint32_t alter) {
    utils.clock.enableGpio(GPIOx_T);
    utils.clock.enableGpio(GPIOx_R);
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin       = 1 << pin_nT;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull      = GPIO_NOPULL;  // or GPIO_PULLUP
    GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Alternate = alter;
    HAL_GPIO_Init(GPIOx_T, &GPIO_InitStructure);
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull  = GPIO_NOPULL;  // or GPIO_PULLUP
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOx_R, &GPIO_InitStructure);

    // this is very special for F303
    RCC_PeriphCLKInitTypeDef PeriphClkInit = { 0 };
    PeriphClkInit.PeriphClockSelection     = RCC_PERIPHCLK_USART2;
    PeriphClkInit.Usart2ClockSelection     = RCC_USART2CLKSOURCE_PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
        // Error_Handler(); // not supported
    }
}
#endif  // STM32F303xE

// ----------------------------------------------------------------------------
#if defined(STM32F407xx) || defined(STM32F427xx)
static void InitUartPins(GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                         GPIO_TypeDef* GPIOx_R, uint8_t pin_nR,
                         uint32_t alter) {
    utils.clock.enableGpio(GPIOx_T);
    utils.clock.enableGpio(GPIOx_R);
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin       = 1 << pin_nT;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull      = GPIO_NOPULL;  // or GPIO_PULLUP
    GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStructure.Alternate = alter;
    HAL_GPIO_Init(GPIOx_T, &GPIO_InitStructure);
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull  = GPIO_NOPULL;  // or GPIO_PULLUP
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(GPIOx_R, &GPIO_InitStructure);
}
#endif  // STM32F407xx || STM32F427xx

// ----------------------------------------------------------------------------
#if defined(STM32F746xx) || defined(STM32F767xx)
static void InitUartPins(GPIO_TypeDef* GPIOx_T, uint8_t pin_nT,
                         GPIO_TypeDef* GPIOx_R, uint8_t pin_nR,
                         uint32_t alter) {
    utils.clock.enableGpio(GPIOx_T);
    utils.clock.enableGpio(GPIOx_R);
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    // TX
    GPIO_InitStructure.Pin       = 1 << pin_nT;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull      = GPIO_PULLUP;  // GPIO_NOPULL?
    GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStructure.Alternate = alter;
    HAL_GPIO_Init(GPIOx_T, &GPIO_InitStructure);
    // RX
    GPIO_InitStructure.Pin   = 1 << pin_nR;
    GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull  = GPIO_PULLUP;  // GPIO_NOPULL?
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(GPIOx_R, &GPIO_InitStructure);
}
#endif  // STM32F746xx || STM32F767xx

// ----------------------------------------------------------------------------
static void InitUartSettings(USART_TypeDef* USARTx, uint32_t baud_rate,
                             uint8_t len, char parity, uint8_t stop_b) {

