dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
    hconsole_.Instance      = USARTx;
    hconsole_.Init.BaudRate = baud_rate;
    switch (len) {
    case 9:
        // todo: this may need extra attention in IRQ
        hconsole_.Init.WordLength = UART_WORDLENGTH_9B;
        break;
    case 8:
    default:
        hconsole_.Init.WordLength = UART_WORDLENGTH_8B;
        break;
    }

    switch (stop_b) {
    case 2:
        hconsole_.Init.StopBits = UART_STOPBITS_2;
        break;
    case 1:
    default:
        hconsole_.Init.StopBits = UART_STOPBITS_1;
        break;
    }

    switch (parity) {
    case 'O':
    case 'o':
        // todo: this may need extra attention
        hconsole_.Init.Parity = UART_PARITY_ODD;
        break;
    case 'E':
    case 'e':
        // todo: this may need extra attention
        hconsole_.Init.Parity = UART_PARITY_EVEN;
        break;
    case 'N':
    case 'n':
    default:
        hconsole_.Init.Parity = UART_PARITY_NONE;
        break;
    }
    hconsole_.Init.Mode         = UART_MODE_TX_RX;
    hconsole_.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    hconsole_.Init.OverSampling = UART_OVERSAMPLING_16;
#if defined(STM32F303xE) || defined(STM32F767xx)
    hconsole_.Init.OneBitSampling         = UART_ONE_BIT_SAMPLE_DISABLE;
    hconsole_.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    UART_MASK_COMPUTATION(&hconsole_);
    uh_mask_ = hconsole_.Mask;
#endif

    HAL_UART_Init(&hconsole_);  // if != HAL_OK ??
}

// ----------------------------------------------------------------------------
void InitUartNvic(uint8_t ch) {
    HAL_NVIC_SetPriority(ch, _CONSOLE_PREEMPTION_PRIORITY,
                         _CONSOLE_SUB_PRIORITY);
    HAL_NVIC_EnableIRQ(ch);
}

// ============================================================================
static void consoleWriteByte(char data) {
    HAL_UART_Transmit(&hconsole_, ( uint8_t* )&data, 1, 10);
}

// ============================================================================
static void consoleWriteStr(char* ptr) {
    HAL_UART_Transmit(&hconsole_, ( uint8_t* )ptr, strlen(ptr), 10);
}

// ============================================================================
// no hardware to test it, need to test in the future
#if defined(_CONSOLE_USE_UART1_PA9PA10) && defined(USART1_EXISTS)
static void InitUSART1_PA9PA10(void) {
#if defined(STM32F103xB)
    InitUartPins(GPIOA, 9, GPIOA, 10, 0);
#elif defined(STM32F107xC)
    InitUartPins(GPIOA, 9, GPIOA, 10);
#error no hardware to verify yet
#elif defined(STM32F407xx)
    InitUartPins(GPIOA, 9, GPIOA, 10, GPIO_AF7_USART1);  // to verify
#else
#error InitUSART1_PA9PA10(): need to implement and verify!
#endif

    InitUartNvic(USART1_IRQn);
}
#endif  // _CONSOLE_USE_UART1_PA9PA10  && defined( USART1_EXISTS )

// ============================================================================
#if defined(_CONSOLE_USE_UART1_PB6PB7) && defined(USART1_EXISTS)
static void InitUSART1_PB6PB7(void) {
#if defined(STM32F107xC)
    InitUartPins(GPIOB, 6, GPIOB, 7);
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART1_ENABLE();
#else
#error InitUSART1_PB6PB7(): need to implement and verify!
#endif
    InitUartNvic(USART1_IRQn);
}
#endif  // _CONSOLE_USE_UART1_PA9PA10

// ---------------------------------------------------------------------------
#if defined(_CONSOLE_USE_UART1_PA9PA10) || defined(_CONSOLE_USE_UART1_PB6PB7)
#if defined(USART1_EXISTS)
void USART1_IRQHandler(void) {
#if defined(STM32F107xC)
    ConsoleUartIRQ();
#else
#error USART1_IRQHandler(): need to implement and verify!
#endif
}
#endif
#endif  // _CONSOLE_USE_UART1_PA9PA10 || _CONSOLE_USE_UART1_PB6PB7

// ============================================================================
#if defined(_CONSOLE_USE_UART2_PA2PA3) && defined(USART2_EXISTS)
static void InitUSART2_PA2PA3(void) {
#if defined(STM32F030x8)
    InitUartPins(GPIOA, 2, GPIOA, 3, GPIO_AF1_USART2);  // verified
#elif defined(STM32F103xB)
    InitUartPins(GPIOA, 2, GPIOA, 3);                   // verified
#elif defined(STM32F107xC)
    InitUartPins(GPIOA, 2, GPIOA, 3);                    // verified
#elif defined(STM32F303xE) || defined(STM32F407xx) || defined(STM32F767xx)
    InitUartPins(GPIOA, 2, GPIOA, 3, GPIO_AF7_USART2);  // verified
#else
#error InitUSART2_PA2PA3(): need to implement and verify!
#endif

    InitUartNvic(USART2_IRQn);
}
#endif  // _CONSOLE_USE_UART2_PA2PA3 && defined( USART2_EXISTS )

// ============================================================================
#if defined(_CONSOLE_USE_UART2_PD5PD6) && defined(USART2_EXISTS)
// TODO
// STM32F107VCT6 does not have USART2 on these pins
static void InitUSART2_PD5PD6(void) {
#if defined(STM32F107xC)
    InitUartPins(GPIOD, 5, GPIOD, 6);  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART2_ENABLE();
#else
#error InitUSART2_PD5PD6(): need to implement and verify!
#endif

    InitUartNvic(USART2_IRQn);
}
#endif  // _CONSOLE_USE_UART2_PD5PD6 && defined( USART2_EXISTS )

// ---------------------------------------------------------------------------
#if defined(_CONSOLE_USE_UART2_PA2PA3) || defined(_CONSOLE_USE_UART2_PD5PD6)
#if defined(USART2_EXISTS)
void USART2_IRQHandler(void) {

// STM32F030x8 is verified
// STM32F103xB is verified
// STM32F107xC is verified
// STM32F303xE is verified
// STM32F407xx is verified
#if defined(STM32F030x8) || defined(STM32F103xB) || defined(STM32F107xC) \
    || defined(STM32F303xE) || defined(STM32F407xx) || defined(STM32F767xx)
    ConsoleUartIRQ();
#else
#error USART2_IRQHandler(): need to implement and verify!
#endif
}
#endif
#endif  // _CONSOLE_USE_UART2_PA2PA3 || _CONSOLE_USE_UART2_PD5PD6

// ============================================================================
#if defined(_CONSOLE_USE_UART3_PB10PB11) && defined(USART3_EXISTS)
static void InitUSART3_PB10PB11(void) {
#if defined(STM32F107xC)
    InitUartPins(GPIOB, 10, GPIOB, 11);  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
#else
#error InitUSART3_PB10PB11(): need to implement and verify!
#endif

    // these may work only for F103, F107, etc, will fix
    InitUartNvic(USART3_IRQn);
}
#endif  // _CONSOLE_USE_UART3_PB10PB11 && defined( USART3_EXISTS )

// ============================================================================
#if defined(_CONSOLE_USE_UART3_PC10PC11) && defined(USART3_EXISTS)
static void InitUSART3_PC10PC11(void) {
#if defined(STM32F107xC)
    InitUartPins(GPIOC, 10, GPIOC, 11);  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART3_PARTIAL();
#else
#error InitUSART3_PC10PC11(): need to implement and verify!
#endif

    InitUartNvic(USART3_IRQn);
}
#endif  // _CONSOLE_USE_UART3_PC10PC11 && defined( USART3_EXISTS )

// ============================================================================
#if defined(_CONSOLE_USE_UART3_PD8PD9) && defined(USART3_EXISTS)
static void InitUSART3_PD8PD9(void) {

