dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
#if defined(STM32F107xC)
    InitUartPins(GPIOD, 8, GPIOD, 9);  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART3_ENABLE();
#elif defined(STM32F746xx) || defined(STM32F767xx)
    InitUartPins(GPIOD, 8, GPIOD, 9, GPIO_AF7_USART3);  // verified
#else
#error InitUSART3_PD8PD9(): need to implement and verify!
#endif

    InitUartNvic(USART3_IRQn);
}
#endif  // _CONSOLE_USE_UART3_PD8PD9 && defined( USART3_EXISTS )

// ---------------------------------------------------------------------------
#if defined(_CONSOLE_USE_UART3_PB10PB11)    \
    || defined(_CONSOLE_USE_UART3_PC10PC11) \
    || defined(_CONSOLE_USE_UART3_PD8PD9)
#if defined(USART3_EXISTS)
void USART3_IRQHandler(void) {
#if defined(STM32F107xC)
    ConsoleUartIRQ();
#elif defined(STM32F746xx)
    ConsoleUartIRQ();
#elif defined(STM32F767xx)
    ConsoleUartIRQ();
#else
#error USART3_IRQHandler(): need to implement and verify!
#endif
}
#endif
#endif  // _CONSOLE_USE_UART3_PB10PB11 || _CONSOLE_USE_UART3_PC10PC11 ||
        // _CONSOLE_USE_UART3_PD8PD9

// ============================================================================
#if defined(_CONSOLE_USE_UART4_PC10PC11) && defined(UART4_EXISTS)
static void InitUART4_PC10PC11(void) {
#if defined(STM32F107xC)
    InitUartPins(GPIOC, 10, GPIOC, 11);  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
#else
#error InitUART4_PC10PC11(): need to implement and verify!
#endif

    InitUartNvic(UART4_IRQn);
}

// ---------------------------------------------------------------------------
void UART4_IRQHandler(void) {
#if defined(STM32F107xC)
    ConsoleUartIRQ();
#else
#error UART4_IRQHandler(): need to implement and verify!
#endif
}
#endif  // _CONSOLE_USE_UART4_PC10PC11 && defined( UART4_EXISTS )

// ============================================================================
#if defined(_CONSOLE_USE_UART5_PC12PD2) && defined(UART5_EXISTS)

// ---------------------------------------------------------------------------
// UART5 test on PC12 (TX) & PD2 (RX)
// supported baud rate: 115200, 230400, 460800, 576000, 921600
static void InitUART5_PC12PD2(void) {
#if defined(STM32F107xC)
    InitUartPins(GPIOC, 12, GPIOD, 2);  // verified
#else
#error InitUART5_PC12PD2(): need to implement and verify!
#endif

    InitUartNvic(UART5_IRQn);
}

// ---------------------------------------------------------------------------
void UART5_IRQHandler(void) {
#if defined(STM32F107xC)
    ConsoleUartIRQ();
#else
#error UART5_IRQHandler(): need to implement and verify!
#endif
}
#endif  // _CONSOLE_USE_UART5_PC12PD2 && defined( UART5_EXISTS )

// ============================================================================
#if defined(_CONSOLE_USE_UART7_PE8PE7) && defined(UART7_EXISTS)
static void InitUART7_PE8PE7(void) {
#if defined(STM32F427xx)
    InitUartPins(GPIOE, 8, GPIOE, 7, GPIO_AF8_UART7);  // verified
#else
#error InitUART7_PE8PE7(): need to implement and verify!
#endif

    InitUartNvic(UART7_IRQn);
}

// ---------------------------------------------------------------------------
void UART7_IRQHandler(void) {
#if defined(STM32F427xx)
    ConsoleUartIRQ();
#else
#error UART7_IRQHandler(): need to implement and verify!
#endif
}
#endif  // _CONSOLE_USE_UART7_PE8PE7 && defined( UART7_EXISTS )

// ============================================================================
extern void ConsolePrintf(char* sign_data, char* format, va_list ap);

// ============================================================================
static void oneThirdPrintk(LogLevel_e level, char* format, ...) {
    if (level <= console.level) {
        char    sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start(ap, format);
        ConsolePrintf(sign_data, format, ap);
        va_end(ap);
    }
}

// ============================================================================
static void oneThirdPrintf(char* format, ...) {
    if (LOG_INFO <= console.level) {
        char    sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start(ap, format);
        ConsolePrintf(sign_data, format, ap);
        va_end(ap);
    }
}

// ============================================================================
static void consoleError(char* format, ...) {
    if (LOG_INFO <= console.level) {
        char    sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start(ap, format);
        while (1) {
            ConsolePrintf(sign_data, format, ap);
            // just some delay
            for (int i = 0; i < 3000; i++) {
                for (int j = 0; j < 3000; j++) {
                    ;
                }
            }
        }
        va_end(ap);
    }
}

// ============================================================================
static char consoleGetChar(uint16_t time) {
    char read_char;
    do {
        if (rb.r_ptr != rb.w_ptr) {
            read_char = *rb.r_ptr;
            if (++rb.r_ptr == (rb.buffer + _CONSOLE_BUFF_LEN)) {
                rb.r_ptr = rb.buffer;
            }
            return read_char;
        }
    } while (time-- != 0);

    return 0;
}

// ============================================================================
static void consoleSetLevel(LogLevel_e l) {
    console.level = l;
}

// ============================================================================
static void ConsoleSetChar(uint8_t* buf, uint32_t len) {
    do {
        if (rb.w_ptr >= rb.r_ptr) {
            if (rb.w_ptr + len <= (rb.buffer + _CONSOLE_BUFF_LEN)) {
                strncpy(rb.w_ptr, ( char* )buf, ( uint16_t )len);
                rb.w_ptr = rb.w_ptr + len;
                buf      = buf + len;
                len      = 0;
                if (rb.w_ptr == (rb.buffer + _CONSOLE_BUFF_LEN)) {
                    rb.w_ptr = rb.buffer;
                }
            }
            else {
                strncpy(rb.w_ptr, ( char* )buf,
                        (uint16_t)((rb.buffer + _CONSOLE_BUFF_LEN) - rb.w_ptr));
                buf      = buf + (rb.buffer + _CONSOLE_BUFF_LEN - rb.w_ptr);
                len      = len - (rb.buffer + _CONSOLE_BUFF_LEN - rb.w_ptr);
                rb.w_ptr = rb.buffer;
            }
        }
        else {
            if (((rb.r_ptr - 1) - rb.w_ptr) >= len) {
                strncpy(rb.w_ptr, ( char* )buf, ( uint16_t )len);
                buf      = buf + len;
                rb.w_ptr = rb.w_ptr + len;
                len      = 0;
            }
            else {
                strncpy(rb.w_ptr, ( char* )buf,
                        (uint16_t)((rb.r_ptr - 1) - rb.w_ptr));
                buf      = buf + ((rb.r_ptr - 1) - rb.w_ptr);
                len      = 0;
                rb.w_ptr = rb.r_ptr - 1;
            }
        }
    } while (len != 0);
}

// ============================================================================
static uint8_t cli_cmd_num_ = 0;
static void    CliAttachCmd(char* str, CliHandle p) {
    if (cli_cmd_num_ < _CLI_CMD_MAX_NUM - 1) {
        cmd_[cli_cmd_num_].str = str;
        cmd_[cli_cmd_num_].p   = p;
        cli_cmd_num_++;
    }
    else {
        console.error(
            "Too many cli commands were registered. \r\nYou can "
            "increase it by defining _CLI_CMD_MAX_NUM in config.h\r\n");
    }
}

// ============================================================================
// HAL_StatusTypeDef CliSuspend( int argc, char** argv );
// -----------------------------
static void consoleConfig(uint32_t baud_rate) {

    console.level = LOG_INFO;
    rb.r_ptr      = rb.buffer;
    rb.w_ptr      = rb.buffer;

#if defined(_CONSOLE_USE_UART1_PA9PA10)
    g_config_usart_used |= 1 << 1;
    InitUSART1_PA9PA10();
    hconsole_.Instance = USART1;
#elif defined(_CONSOLE_USE_UART1_PB6PB7)
    g_config_usart_used |= 1 << 1;
    InitUSART1_PB6PB7();
    hconsole_.Instance = USART1;
#elif defined(_CONSOLE_USE_UART2_PA2PA3)
    g_config_usart_used |= 1 << 2;
    InitUSART2_PA2PA3();
    hconsole_.Instance     = USART2;
#elif defined(_CONSOLE_USE_UART2_PD5PD6)
    g_config_usart_used |= 1 << 2;
    InitUSART2_PD5PD6();
    hconsole_.Instance     = USART2;
#elif defined(_CONSOLE_USE_UART3_PB10PB11)
    g_config_usart_used |= 1 << 3;
    InitUSART3_PB10PB11();
    hconsole_.Instance     = USART3;
#elif defined(_CONSOLE_USE_UART3_PC10PC11)
    g_config_usart_used |= 1 << 3;
    InitUSART3_PC10PC11();
    hconsole_.Instance     = USART3;
#elif defined(_CONSOLE_USE_UART3_PD8PD9)
    g_config_usart_used |= 1 << 3;
    InitUSART3_PD8PD9();
    hconsole_.Instance     = USART3;
#elif defined(_CONSOLE_USE_UART4_PC10PC11)
    g_config_usart_used |= 1 << 4;
    InitUART4_PC10PC11();
    hconsole_.Instance     = UART4;
#elif defined(_CONSOLE_USE_UART5_PC12PD2)
    g_config_usart_used |= 1 << 5;
    InitUART5_PC12PD2();
    hconsole_.Instance     = UART5;
#elif defined(_CONSOLE_USE_UART7_PE8PE7)
    g_config_usart_used |= 1 << 7;
    InitUART7_PE8PE7();
    hconsole_.Instance     = UART7;
#else
#error consoleConfig(): not implemented!
#endif
    // usart setting -------------
    utils.clock.enableUart(hconsole_.Instance);
    InitUartSettings(hconsole_.Instance, baud_rate, 8, 'n', 1);
    __HAL_UART_ENABLE(&hconsole_);

    // command line interface -------------
    memset(&cli_, '\0', sizeof(cli_));
    memset(cmd_, '\0', sizeof(cmd_[100]));
    cli_.out_message = "\r\n" CYN _CLI_OUT_MESSAGE NOC ": ";
    CliDeInit();

    // register some default commands -------------
    CliAttachCmd("help", ( CliHandle )CliShowCmd);
    CliAttachCmd("system &cmd", ( CliHandle )CliSystem);
    CliAttachCmd("log &level", ( CliHandle )CliLogSetLevel);
    CliAttachCmd("scheduler &cmd", ( CliHandle )CliShowScheduler);

#if defined(_STIME_USE_SCHEDULER)
    CliAttachCmd("cli-suspend &seconds", ( CliHandle )CliSuspend);
#endif

    console.enableRxen(true);
}

// ============================================================================
static void consoleTxMode(ConsoleTx_e tx) {
    GPIO_InitTypeDef GPIO_InitStructure;
    if (tx == TX_PP) {
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    }
    else if (tx == TX_OD) {
        GPIO_InitStructure.Mode = GPIO_MODE_AF_OD;
    }
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
#if defined(_CONSOLE_USE_UART1_PA9PA10)
    GPIO_InitStructure.Pin = GPIO_PIN_9;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART1_PB6PB7)
    GPIO_InitStructure.Pin = GPIO_PIN_6;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART2_PA2PA3)
    GPIO_InitStructure.Pin = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART2_PD5PD6)
    GPIO_InitStructure.Pin = GPIO_PIN_5;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART3_PB10PB11)
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART3_PC10PC11)
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART3_PD8PD9)
    GPIO_InitStructure.Pin = GPIO_PIN_8;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART4_PC10PC11)
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART5_PC12PD2)
    GPIO_InitStructure.Pin = GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART7_PE8PE7)
    GPIO_InitStructure.Pin = GPIO_PIN_8;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);
#else
#error console_TX_Mode(): not implemented!
#endif
}

// ============================================================================
static void consoleEnableRxen(bool enable) {
    if (enable) {
        __HAL_UART_ENABLE_IT(&hconsole_, UART_IT_RXNE);
    }
    else {
        __HAL_UART_DISABLE_IT(&hconsole_, UART_IT_RXNE);
    }
}

// ============================================================================
static void consoleSetRxStatus(bool v) {
    console_rx_enabled_ = v;
}

// ============================================================================
static bool consoleGetRxStatus(void) {
    return console_rx_enabled_;
}

// ============================================================================
// some values:
// \n: 0d10
// \r: 0d13
// keys:
// ENTER    : 0d13 (0x0D)
// ESC      : 0d27 (0x1B)
// Tab      : 0d09 (0x09)
// backspace: 0d127 (0x7F)
// space    : 0d32 (0x20)

// 0x1B then 0x5B:
// up arrow: 0d27, then 0d91 (0x1B, then 0x5B)
// down arrow: 0d27, then 0d91 (0x1B, then 0x5B), why it is the same as up
//             arrow?
// left/right arrows: the same
// home, end, page up, page down, delete

static void CliProcess(void) {
    char           read_char;
    static uint8_t label = 0;

    while ((read_char = console.read(0)) != 0) {
        if (read_char == '\n' || read_char == '\r') {
            label = 0;
            if ((cli_.cmd_buff == cli_.cmd_buff_tail)
                || (cli_.cmd_buff[0] == ' ')) {
                ;  // just do nothing
            }
            else {
                if (*(--cli_.cmd_buff_tail) == ' ') {
                    *cli_.cmd_buff_tail = '\0';
                }
                CliProcessCmd(cli_.cmd_buff);
                CliDeInit();
            }
            console.writeStr(cli_.out_message);
        }
        else {
            if (read_char == 0x09) {
                CliTabCompletion(console.read(0xffff));
            }
            // 0x7F is the key value of backspace on Linux
            else if (read_char == 0x7F) {
                CliBackspace();
            }
            else if ((read_char >= '\b') && (read_char < ' ')) {
                label = 0;

                if (read_char == 0x1b && console.read(0xffff) == 0x5b) {
                    CliDirection(console.read(0xffff));
                }
            }
            else if ((read_char >= ' ') && (read_char <= '~')) {
                if (read_char == '#' || label == 1) {
                    label = true;
                }
                else if ((cli_.cmd_buff_tail - cli_.cmd_buff)
                         < (_CLI_CMD_MAX_LEN - 1)) {
                    CliInput(read_char);
                }
            }
        }
    }
}

// ============================================================================
// clang-format off
Console_t console = {
    .level       = LOG_INFO          ,
    .config      = consoleConfig     ,
    .setTxMode   = consoleTxMode     ,
    .enableRxen  = consoleEnableRxen ,
    .setRxStatus = consoleSetRxStatus,
    .getRxStatus = consoleGetRxStatus,
    .printk      = oneThirdPrintk    ,
    .printf      = oneThirdPrintf    ,
    .error       = consoleError      ,
    .writeByte   = consoleWriteByte  ,
    .writeStr    = consoleWriteStr   ,
    .read        = consoleGetChar    ,

    // cli related
    .cli.setLevel = consoleSetLevel,
    .cli.attach   = CliAttachCmd   ,
    .cli.process  = CliProcess     ,
};
// clang-format on

#endif  //  CONSOLE_IS_USED
